tests/staf-tests/functional-tests/shared/data/dsml/suites/04addmodaddsuite/data/add150.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 6085
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
        <addRequest dn="uid=foo49, ou=people, o=dsmlfe.com">
        <attr name="mail">
        <value>foo49@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 222 2222</value>
        </attr>
        <attr name="cn">
        <value>foo 49</value>
        </attr>
        <attr name="uid">
        <value>foo49</value>
        </attr>
        <attr name="roomnumber">
        <value>329k</value>
        </attr>
        <attr name="sn">
        <value>49</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="seealso">
        <value>cn=Directory Manager</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 222 2222</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
        <addRequest dn="uid=foo50, ou=people, o=dsmlfe.com">
        <attr name="mail">
        <value>foo50@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 333 3333</value>
        </attr>
        <attr name="cn">
        <value>foo 50</value>
        </attr>
        <attr name="uid">
        <value>foo50</value>
        </attr>
        <attr name="roomnumber">
        <value>93l</value>
        </attr>
        <attr name="sn">
        <value>50</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="seealso">
        <value>cn=Directory Manager</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 333 3333</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
        <addRequest dn="uid=foo51, ou=people, o=dsmlfe.com">
        <attr name="mail">
        <value>foo51@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 555 555 5555</value>
        </attr>
        <attr name="cn">
        <value>foo 51</value>
        </attr>
        <attr name="uid">
        <value>foo51</value>
        </attr>
        <attr name="roomnumber">
        <value>39k</value>
        </attr>
        <attr name="sn">
        <value>51</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="seealso">
        <value>cn=Directory Manager</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 555 555 5555</value>
        </attr>
        <attr name="l">
        <value>fooabr</value>
        </attr>
        </addRequest>
        <addRequest dn="uid=foo52, ou=people, o=dsmlfe.com">
        <attr name="mail">
        <value>foo52@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 444 444 4444</value>
        </attr>
        <attr name="cn">
        <value>foo 52</value>
        </attr>
        <attr name="uid">
        <value>foo52</value>
        </attr>
        <attr name="roomnumber">
        <value>3l</value>
        </attr>
        <attr name="sn">
        <value>52</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="seealso">
        <value>cn=Directory Manager</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 444 444 4444</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
        <addRequest dn="uid=foo53, ou=people, o=dsmlfe.com">
        <attr name="mail">
        <value>foo53@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 777 777 7777</value>
        </attr>
        <attr name="cn">
        <value>foo53</value>
        </attr>
        <attr name="uid">
        <value>foo53</value>
        </attr>
        <attr name="roomnumber">
        <value>329k</value>
        </attr>
        <attr name="sn">
        <value>53</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="seealso">
        <value>cn=Directory Manager</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 222 222 2222</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
